Code/CalendarParse/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CSSE375 Assignment: Parsing Calendar Data</title>
<!-- 2015-03-04 Wed 17:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Buffalo" />


</head>
<body>
<div id="content">
<h1 class="title">CSSE375 Assignment: Parsing Calendar Data</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. What is this?</a></li>
<li><a href="#sec-2">2. What do I need to do?</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is this?</h2>
<div class="outline-text-2" id="text-1">
<p>
So imagine that you’re writing an application take takes different
feeds of calendar event data.  The goal of this application is to load
in a variety of different kinds of event data and produce a unified
calendar with all the events listed on the day they occur.  The code
you’ve been give implements a rudimentary user interface.  It asks for
a input file and a calendar format.  Then it puts you into “command mode”
where you can enter specific commands. Right now the only command that
works is “displayday” which finds all the events that occur on a
particular day and prints out summaries of all the title of events
that occur on that day.
</p>


<p>
You can see an example of it working below (the data file in question
is Examples/Duke/simple_sample.xml).
</p>

<pre class="example">
Ready for commands! Available commands: 
quit
displayday YYYY MM DD
&gt; displayday 2012 11 01
Example event 1
Example event 2
&gt; displayday 2012 11 02
Example event 3 (different day)
&gt; quit
Exiting normally.
</pre>

<p>
The code you’ve been given is designed to parse two kinds of data
source.  One is a kind of calendar data used by Duke university.  The
other is the output of GoogleCalendar.  Both of these formats are XML.
</p>


<p>
I’ve included some sample data, but if you’d like to generate your own
you can do so here:
<a href="http://calendar.duke.edu/static/url_machine/">http://calendar.duke.edu/static/url_machine/</a>
<a href="https://www.google.com/calendar/feeds/hewner@gmail.com/public/basic">https://www.google.com/calendar/feeds/hewner@gmail.com/public/basic</a>
</p>

<p>
You can also find instructions for getting your own google calendar
data here (use the XML options):
</p>

<p>
<a href="http://support.google.com/calendar/bin/answer.py?hl=en&answer=37648">http://support.google.com/calendar/bin/answer.py?hl=en&answer=37648</a>
</p>


<p>
If you’re not familiar with XML files, you can see a brief intro here: <a href="http://www.ibm.com/developerworks/xml/tutorials/xmlintro/section2.html">http://www.ibm.com/developerworks/xml/tutorials/xmlintro/section2.html</a>.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What do I need to do?</h2>
<div class="outline-text-2" id="text-2">
<p>
So right now the code is ugly.  I'm not going to enumerate its design
problems (we'll talk about it a little in class) - I'd like to see
your take.
</p>

<p>
Imagine that we want to take this idea of interacting with different
calendars and expand it.  We want to add many more supported types of
calendars, and we want to add many more operations.  We want a design
that will let us add support for new calendar types and new operations
really easily.
</p>

<p>
Refactor the code to improve the design and make the code clean.
</p>

<p>
It should require significant changes, including new classes,
structure, etc.
</p>

<p>
Do not change the functionality of the code at all - from the user's
perspective, the code should function in exactly the same way.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Buffalo</p>
<p class="date">Created: 2015-03-04 Wed 17:10</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
